/**
  ******************************************************************************
  * @file    bsp.c 
  * @author  Apexyuan
  * @version V1.0.0
  * @date    2019-12-10
  * @brief   板级支持包，包括驱动层和HAL层（目前两部分是合在一起的没有进一步分开）
  ******************************************************************************
  * @attention
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/ 
#include "bsp.h"
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  初始化底层硬件驱动
  * @param  None
  * @retval None
  */
void bsp_init(void)
{
  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4); //设置中断优先级分组
  //systick_init();
  led_init();
  usart1_init(115200);
  usart3_init(9600);
  motor_init();
  encoder_init();
  while(MPU_DMP_Init());
  timer_init(999,71);
  TIM_Cmd(TIM1, ENABLE);
  led_on(LED0);
}





