/**
  ******************************************************************************
  * @file    lowPassFilter.c 
  * @author  Apexyuan
  * @version V1.0.0
  * @date    2019-12-09
  * @brief   低通滤波器实现
  ******************************************************************************
  * @attention
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/ 

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  一介低通滤波器
  * @param  filteredData: 滤波数据指针，需要传入滤波前的数据计算后变为滤波后的结果
  * @param  rawData: 需要滤波处理的原始数据
  * @param  gain: 增益，原始数据的滤波增益
  * @retval None
  */
void lowPassFilter(float * filterData, float rawData, float gain)
{
  *filterData = (*filterData) * (1 - gain) + rawData * gain; 
}





